[
  {
    "id": "CVE-2022-4796",
    "repo_url": "https://github.com/usememos/memos",
    "details": "Incorrect Use of Privileged APIs in GitHub repository usememos/memos prior to 0.9.1.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2022-39261",
    "repo_url": "https://github.com/drupal/drupal",
    "details": "Twig is a template language for PHP. Versions 1.x prior to 1.44.7, 2.x prior to 2.15.3, and 3.x prior to 3.4.3 encounter an issue when the filesystem loader loads templates for which the name is a user input. It is possible to use the `source` or `include` statement to read arbitrary files from outside the templates' directory when using a namespace like `@somewhere/../some.file`. In such a case, validation is bypassed. Versions 1.44.7, 2.15.3, and 3.4.3 contain a fix for validation of such template names. There are no known workarounds aside from upgrading.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2023-38040",
    "repo_url": "https://github.com/revive-adserver/revive-adserver",
    "details": "A reflected XSS vulnerability exists in Revive Adserver 5.4.1 and earlier versions..",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2020-18190",
    "repo_url": "https://github.com/bludit/bludit",
    "details": "Bludit v3.8.1 is affected by directory traversal. Remote attackers are able to delete arbitrary files via /admin/ajax/upload-profile-picture.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-46510",
    "repo_url": "https://github.com/cesanta/mjs",
    "details": "There is an Assertion `s < mjs->owned_strings.buf + mjs->owned_strings.len' failed at src/mjs_gc.c in Cesanta MJS v2.20.0.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2022-39201",
    "repo_url": "https://github.com/grafana/grafana",
    "details": "Grafana is an open source observability and data visualization platform. Starting with version 5.0.0-beta1 and prior to versions 8.5.14 and 9.1.8, Grafana could leak the authentication cookie of users to plugins. The vulnerability impacts data source and plugin proxy endpoints under certain conditions. The destination plugin could receive a user's Grafana authentication cookie. Versions 9.1.8 and 8.5.14 contain a patch for this issue. There are no known workarounds.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2022-1432",
    "repo_url": "https://github.com/foosel/octoprint",
    "details": "Cross-site Scripting (XSS) - Generic in GitHub repository octoprint/octoprint prior to 1.8.0.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2019-20012",
    "repo_url": "https://github.com/libredwg/libredwg",
    "details": "An issue was discovered in GNU LibreDWG 0.92. Crafted input will lead to an attempted excessive memory allocation in dwg_decode_HATCH_private in dwg.spec.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2022-0929",
    "repo_url": "https://github.com/microweber/microweber",
    "details": "XSS on dynamic_text module in GitHub repository microweber/microweber prior to 1.2.11.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2019-8439",
    "repo_url": "https://github.com/chekun/dilicms",
    "details": "An issue was discovered in DiliCMS 2.4.0. There is a Stored XSS Vulnerability in the second textbox of \"System setting->site setting\" of admin/index.php, aka site_domain.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-35063",
    "repo_url": "https://github.com/oisf/suricata",
    "details": "Suricata before 5.0.7 and 6.x before 6.0.3 has a \"critical evasion.\"",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2020-6861",
    "repo_url": "https://github.com/ledgerhq/app-monero",
    "details": "A flawed protocol design in the Ledger Monero app before 1.5.1 for Ledger Nano and Ledger S devices allows a local attacker to extract the master spending key by sending crafted messages to this app selected on a PIN-entered Ledger connected to a host PC.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2022-23071",
    "repo_url": "https://github.com/tandoorrecipes/recipes",
    "details": "In Recipes, versions 0.9.1 through 1.2.5 are vulnerable to Server Side Request Forgery (SSRF), in the “Import Recipe” functionality. When an attacker enters the localhost URL, a low privileged attacker can access/read the internal file system to access sensitive information.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2022-37785",
    "repo_url": "https://github.com/webankpartners/wecube-platform",
    "details": "An issue was discovered in WeCube Platform 3.2.2. Cleartext passwords are displayed in the configuration for terminal plugins.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2016-9891",
    "repo_url": "https://github.com/dotclear/dotclear",
    "details": "Cross-site scripting (XSS) vulnerability in admin/media.php and admin/media_item.php in Dotclear before 2.11 allows remote authenticated users to inject arbitrary web script or HTML via the upfiletitle or media_title parameter (aka the media title).",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2023-24450",
    "repo_url": "https://github.com/jenkinsci/view-cloner-plugin",
    "details": "Jenkins view-cloner Plugin 1.1 and earlier stores passwords unencrypted in job config.xml files on the Jenkins controller where they can be viewed by users with Extended Read permission, or access to the Jenkins controller file system.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2023-25658",
    "repo_url": "https://github.com/tensorflow/tensorflow",
    "details": "TensorFlow is an open source platform for machine learning. Prior to versions 2.12.0 and 2.11.1, an out of bounds read is in GRUBlockCellGrad. A fix is included in TensorFlow 2.12.0 and 2.11.1.\n",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-35474",
    "repo_url": "https://github.com/apache/trafficserver",
    "details": "Stack-based Buffer Overflow vulnerability in cachekey plugin of Apache Traffic Server. This issue affects Apache Traffic Server 7.0.0 to 7.1.12, 8.0.0 to 8.1.1, 9.0.0 to 9.0.1.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2020-29367",
    "repo_url": "https://github.com/blosc/c-blosc2",
    "details": "blosc2.c in Blosc C-Blosc2 through 2.0.0.beta.5 has a heap-based buffer overflow when there is a lack of space to write compressed data.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-22174",
    "repo_url": "https://github.com/wireshark/wireshark",
    "details": "Crash in USB HID dissector in Wireshark 3.4.0 to 3.4.2 allows denial of service via packet injection or crafted capture file",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2018-14360",
    "repo_url": "https://github.com/neomutt/neomutt",
    "details": "An issue was discovered in NeoMutt before 2018-07-16. nntp_add_group in newsrc.c has a stack-based buffer overflow because of incorrect sscanf usage.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2018-1110",
    "repo_url": "https://github.com/cz-nic/knot-resolver",
    "details": "A flaw was found in knot-resolver before version 2.3.0. Malformed DNS messages may cause denial of service.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2016-4442",
    "repo_url": "https://github.com/miniprofiler/rack-mini-profiler",
    "details": "The rack-mini-profiler gem before 0.10.1 for Ruby allows remote attackers to obtain sensitive information about allocated strings and objects by leveraging incorrect ordering of security checks.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2019-8979",
    "repo_url": "https://github.com/kohana/kohana",
    "details": "Kohana through 3.3.6 has SQL Injection when the order_by() parameter can be controlled.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2023-27114",
    "repo_url": "https://github.com/radareorg/radare2",
    "details": "radare2 v5.8.3 was discovered to contain a segmentation fault via the component wasm_dis at p/wasm/wasm.c.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2018-5690",
    "repo_url": "https://github.com/dotclear/dotclear",
    "details": "Cross-site scripting (XSS) vulnerability in admin/users.php in Dotclear 2.12.1 allows remote authenticated users to inject arbitrary web script or HTML via the nb parameter (aka the page limit number).",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2023-3019",
    "repo_url": "https://github.com/qemu/qemu",
    "details": "A DMA reentrancy issue leading to a use-after-free error was found in the e1000e NIC emulation code in QEMU. This issue could allow a privileged guest user to crash the QEMU process on the host, resulting in a denial of service.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2018-11127",
    "repo_url": "https://github.com/e107inc/e107",
    "details": "e107 2.1.7 has CSRF resulting in arbitrary user deletion.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2019-7930",
    "repo_url": "https://github.com/magento/devdocs",
    "details": "A file upload restriction bypass exists in Magento 2.1 prior to 2.1.18, Magento 2.2 prior to 2.2.9, Magento 2.3 prior to 2.3.2. An authenticated user with administrator privileges to the import feature can make modifications to a configuration file, resulting in potentially unauthorized removal of file upload restrictions. This can result in arbitrary code execution when a malicious file is then uploaded and executed on the system.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2022-0906",
    "repo_url": "https://github.com/microweber/microweber",
    "details": "Unrestricted file upload leads to stored XSS in GitHub repository microweber/microweber prior to 1.1.12.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-22242",
    "repo_url": "https://gitlab.com/gitlab-org/gitlab",
    "details": "Insufficient input sanitization in Mermaid markdown in GitLab CE/EE version 11.4 and up allows an attacker to exploit a stored cross-site scripting vulnerability via a specially-crafted markdown",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2023-27821",
    "repo_url": "https://github.com/vran-dev/databasir",
    "details": "Databasir v1.0.7 was discovered to contain a remote code execution (RCE) vulnerability via the mockDataScript parameter.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2019-18928",
    "repo_url": "https://github.com/cyrusimap/cyrus-imapd",
    "details": "Cyrus IMAP 2.5.x before 2.5.14 and 3.x before 3.0.12 allows privilege escalation because an HTTP request may be interpreted in the authentication context of an unrelated previous request that arrived over the same connection.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2022-37393",
    "repo_url": "https://github.com/zimbra/zm-build",
    "details": "Zimbra's sudo configuration permits the zimbra user to execute the zmslapd binary as root with arbitrary parameters. As part of its intended functionality, zmslapd can load a user-defined configuration file, which includes plugins in the form of .so files, which also execute as root.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2019-12047",
    "repo_url": "https://github.com/getgridea/gridea",
    "details": "Gridea v0.8.0 has an XSS vulnerability through which the Nodejs module can be called to achieve arbitrary code execution, as demonstrated by child_process.exec and the \"<img src=# onerror='eval(new Buffer(\" substring.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-41189",
    "repo_url": "https://github.com/dspace/dspace",
    "details": "DSpace is an open source turnkey repository application. In version 7.0, any community or collection administrator can escalate their permission up to become system administrator. This vulnerability only exists in 7.0 and does not impact 6.x or below. This issue is patched in version 7.1. As a workaround, users of 7.0 may temporarily disable the ability for community or collection administrators to manage permissions or workflows settings.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2024-4326",
    "repo_url": "https://github.com/parisneo/lollms-webui",
    "details": "A vulnerability in parisneo/lollms-webui versions up to 9.3 allows remote attackers to execute arbitrary code. The vulnerability stems from insufficient protection of the `/apply_settings` and `/execute_code` endpoints. Attackers can bypass protections by setting the host to localhost, enabling code execution, and disabling code validation through the `/apply_settings` endpoint. Subsequently, arbitrary commands can be executed remotely via the `/execute_code` endpoint, exploiting the delay in settings enforcement. This issue was addressed in version 9.5.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2020-17467",
    "repo_url": "https://github.com/butok/fnet",
    "details": "An issue was discovered in FNET through 4.6.4. The code for processing the hostname from an LLMNR request doesn't check for '\\0' termination. Therefore, the deduced length of the hostname doesn't reflect the correct length of the actual data. This may lead to Information Disclosure in _fnet_llmnr_poll in fnet_llmnr.c during a response to a malicious request of the DNS class IN.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-40639",
    "repo_url": "https://github.com/jflyfox/jfinal_cms",
    "details": "Improper access control in Jfinal CMS 5.1.0 allows attackers to access sensitive information via /classes/conf/db.properties&config=filemanager.config.js.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2022-24526",
    "repo_url": "https://github.com/microsoft/vscode",
    "details": "Visual Studio Code Spoofing Vulnerability",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2022-29042",
    "repo_url": "https://github.com/jenkinsci/jobgenerator-plugin",
    "details": "Jenkins Job Generator Plugin 1.22 and earlier does not escape the name and description of Generator Parameter and Generator Choice parameters on Job Generator jobs' Build With Parameters views, resulting in a stored cross-site scripting (XSS) vulnerability exploitable by attackers with Item/Configure permission.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-23463",
    "repo_url": "https://github.com/h2database/h2database",
    "details": "The package com.h2database:h2 from 1.4.198 and before 2.0.202 are vulnerable to XML External Entity (XXE) Injection via the org.h2.jdbc.JdbcSQLXML class object, when it receives parsed string data from org.h2.jdbc.JdbcResultSet.getSQLXML() method. If it executes the getSource() method when the parameter is DOMSource.class it will trigger the vulnerability.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2020-14830",
    "repo_url": "https://github.com/mysql/mysql-server",
    "details": "Vulnerability in the MySQL Server product of Oracle MySQL (component: Server: Optimizer). Supported versions that are affected are 8.0.21 and prior. Easily exploitable vulnerability allows low privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.1 Base Score 6.5 (Availability impacts). CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H).",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2023-26839",
    "repo_url": "https://github.com/churchcrm/crm",
    "details": "A cross-site request forgery (CSRF) vulnerability in ChurchCRM v4.5.3 allows attackers to edit information for existing people on the site.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-39185",
    "repo_url": "https://github.com/http4s/http4s",
    "details": "Http4s is a minimal, idiomatic Scala interface for HTTP services. In http4s versions 0.21.26 and prior, 0.22.0 through 0.22.2, 0.23.0, 0.23.1, and 1.0.0-M1 through 1.0.0-M24, the default CORS configuration is vulnerable to an origin reflection attack. The middleware is also susceptible to a Null Origin Attack. The problem is fixed in 0.21.27, 0.22.3, 0.23.2, and 1.0.0-M25. The original `CORS` implementation and `CORSConfig` are deprecated. See the GitHub GHSA for more information, including code examples and workarounds.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-33304",
    "repo_url": "https://github.com/tass-belgium/picotcp",
    "details": "Double Free vulnerability in virtualsquare picoTCP v1.7.0 and picoTCP-NG v2.1 in modules/pico_fragments.c in function pico_fragments_reassemble, allows attackers to execute arbitrary code.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2022-48422",
    "repo_url": "https://github.com/onlyoffice/documentserver",
    "details": "ONLYOFFICE Docs through 7.3 on certain Linux distributions allows local users to gain privileges via a Trojan horse libgcc_s.so.1 in the current working directory, which may be any directory in which an ONLYOFFICE document is located.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2018-17974",
    "repo_url": "https://github.com/appneta/tcpreplay",
    "details": "An issue was discovered in Tcpreplay 4.3.0 beta1. A heap-based buffer over-read was triggered in the function dlt_en10mb_encode() of the file plugins/dlt_en10mb/en10mb.c, due to inappropriate values in the function memmove(). The length (pktlen + ctx -> l2len) can be larger than source value (packet + ctx->l2len) because the function fails to ensure the length of a packet is valid. This leads to Denial of Service.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2022-0588",
    "repo_url": "https://github.com/librenms/librenms",
    "details": "Missing Authorization in Packagist librenms/librenms prior to 22.2.0.\n\n",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2018-19609",
    "repo_url": "https://github.com/star7th/showdoc",
    "details": "ShowDoc 2.4.1 allows remote attackers to obtain sensitive information by navigating with a modified page_id, as demonstrated by reading note content, or discovering a username in the JSON data at a diff URL.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2024-23178",
    "repo_url": "https://github.com/wikimedia/mediawiki",
    "details": "An issue was discovered in the Phonos extension in MediaWiki before 1.40.2. PhonosButton.js allows i18n-based XSS via the phonos-purge-needed-error message.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2020-36048",
    "repo_url": "https://github.com/socketio/engine.io",
    "details": "Engine.IO before 4.0.0 allows attackers to cause a denial of service (resource consumption) via a POST request to the long polling transport.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2023-47100",
    "repo_url": "https://github.com/perl/perl5",
    "details": "In Perl before 5.38.2, S_parse_uniprop_string in regcomp.c can write to unallocated space because a property name associated with a \\p{...} regular expression construct is mishandled. The earliest affected version is 5.30.0.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-2481",
    "repo_url": "https://github.com/mysql/mysql-server",
    "details": "Vulnerability in the MySQL Server product of Oracle MySQL (component: Server: Optimizer). Supported versions that are affected are 8.0.26 and prior. Easily exploitable vulnerability allows low privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.1 Base Score 6.5 (Availability impacts). CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:L/UI:N/S:U/C:N/I:N/A:H).",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2022-39330",
    "repo_url": "https://github.com/nextcloud/server",
    "details": "Nextcloud Server is the file server software for Nextcloud, a self-hosted productivity platform. Nextcloud Server prior to versions 23.0.10 and 24.0.6 and Nextcloud Enterprise Server prior to versions 22.2.10, 23.0.10, and 24.0.6 are vulnerable to a logged-in attacker slowing down the system by generating a lot of database/cpu load. Nextcloud Server versions 23.0.10 and 24.0.6 and Nextcloud Enterprise Server versions 22.2.10, 23.0.10, and 24.0.6 contain patches for this issue. As a workaround, disable the Circles app.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2017-11430",
    "repo_url": "https://github.com/omniauth/omniauth-saml",
    "details": "OmniAuth OmnitAuth-SAML 1.9.0 and earlier may incorrectly utilize the results of XML DOM traversal and canonicalization APIs in such a way that an attacker may be able to manipulate the SAML data without invalidating the cryptographic signature, allowing the attack to potentially bypass authentication to SAML service providers.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2020-15099",
    "repo_url": "https://github.com/typo3/typo3.cms",
    "details": "In TYPO3 CMS greater than or equal to 9.0.0 and less than 9.5.20, and greater than or equal to 10.0.0 and less than 10.4.6, in a case where an attacker manages to generate a valid cryptographic message authentication code (HMAC-SHA1) - either by using a different existing vulnerability or in case the internal encryptionKey was exposed - it is possible to retrieve arbitrary files of a TYPO3 installation. This includes the possibility to fetch typo3conf/LocalConfiguration.php, which again contains the encryptionKey as well as credentials of the database management system being used. In case a database server is directly accessible either via internet or in a shared hosting network, this allows the ability to completely retrieve, manipulate or delete database contents. This includes creating an administration user account - which can be used to trigger remote code execution by injecting custom extensions. This has been patched in versions 9.5.20 and 10.4.6.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2018-2590",
    "repo_url": "https://github.com/mysql/mysql-server",
    "details": "Vulnerability in the MySQL Server component of Oracle MySQL (subcomponent: Server: Performance Schema). Supported versions that are affected are 5.6.38 and prior and 5.7.20 and prior. Easily exploitable vulnerability allows high privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.0 Base Score 4.9 (Availability impacts). CVSS Vector: (CVSS:3.0/AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H).",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2017-18531",
    "repo_url": "https://github.com/mindscapehq/raygun4wordpress",
    "details": "The raygun4wp plugin before 1.8.3 for WordPress has XSS in the settings, a different issue than CVE-2017-9288.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2018-1999017",
    "repo_url": "https://github.com/pydio/pydio-core",
    "details": "Pydio version 8.2.0 and earlier contains a Server-Side Request Forgery (SSRF) vulnerability in plugins/action.updater/UpgradeManager.php Line: 154, getUpgradePath($url) that can result in an authenticated admin users requesting arbitrary URL's, pivoting requests through the server. This attack appears to be exploitable via the attacker gaining access to an administrative account, enters a URL into Upgrade Engine, and reloads the page or presses \"Check Now\". This vulnerability appears to have been fixed in 8.2.1.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2023-28706",
    "repo_url": "https://github.com/apache/airflow",
    "details": "Improper Control of Generation of Code ('Code Injection') vulnerability in Apache Software Foundation Apache Airflow Hive Provider.This issue affects Apache Airflow Hive Provider: before 6.0.0.\n\n",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2017-9841",
    "repo_url": "https://github.com/sebastianbergmann/phpunit",
    "details": "Util/PHP/eval-stdin.php in PHPUnit before 4.8.28 and 5.x before 5.6.3 allows remote attackers to execute arbitrary PHP code via HTTP POST data beginning with a \"<?php \" substring, as demonstrated by an attack on a site with an exposed /vendor folder, i.e., external access to the /vendor/phpunit/phpunit/src/Util/PHP/eval-stdin.php URI.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-37700",
    "repo_url": "https://github.com/github/paste-markdown",
    "details": "@github/paste-markdown is an npm package for pasting markdown objects. A self Cross-Site Scripting vulnerability exists in the @github/paste-markdown before version 0.3.4. If the clipboard data contains the string `<table>`, a **div** is dynamically created, and the clipboard content is copied into its **innerHTML** property without any sanitization, resulting in improper execution of JavaScript in the browser of the victim (the user who pasted the code). Users directed to copy text from a malicious website and paste it into pages that utilize this library are affected. This is fixed in version 0.3.4. Refer the to the referenced GitHub Advisory for more details including an example exploit.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2019-3881",
    "repo_url": "https://github.com/bundler/bundler",
    "details": "Bundler prior to 2.1.0 uses a predictable path in /tmp/, created with insecure permissions as a storage location for gems, if locations under the user's home directory are not available. If Bundler is used in a scenario where the user does not have a writable home directory, an attacker could place malicious code in this directory that would be later loaded and executed.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2020-15121",
    "repo_url": "https://github.com/radare/radare2",
    "details": "In radare2 before version 4.5.0, malformed PDB file names in the PDB server path cause shell injection. To trigger the problem it's required to open the executable in radare2 and run idpd to trigger the download. The shell code will execute, and will create a file called pwned in the current directory.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2017-17775",
    "repo_url": "https://github.com/piwigo/piwigo",
    "details": "Piwigo 2.9.2 has XSS via the name parameter in an admin.php?page=album-3-properties request.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-29616",
    "repo_url": "https://github.com/tensorflow/tensorflow",
    "details": "TensorFlow is an end-to-end open source platform for machine learning. The implementation of TrySimplify(https://github.com/tensorflow/tensorflow/blob/c22d88d6ff33031aa113e48aa3fc9aa74ed79595/tensorflow/core/grappler/optimizers/arithmetic_optimizer.cc#L390-L401) has undefined behavior due to dereferencing a null pointer in corner cases that result in optimizing a node with no inputs. The fix will be included in TensorFlow 2.5.0. We will also cherrypick this commit on TensorFlow 2.4.2, TensorFlow 2.3.3, TensorFlow 2.2.3 and TensorFlow 2.1.4, as these are also affected and still in supported range.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-32157",
    "repo_url": "https://github.com/webmin/webmin",
    "details": "A Cross-Site Scripting (XSS) vulnerability exists in Webmin 1.973 via the Scheduled Cron Jobs feature.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2023-6427",
    "repo_url": "https://github.com/bigprof-software/online-invoicing-system",
    "details": "A vulnerability has been discovered in BigProf Online Invoicing System 2.6, which does not sufficiently encode user-controlled input, resulting in persistent XSS through /invoicing/app/invoices_view.php, in the FirstRecord parameter. Exploitation of this vulnerability could allow an attacking user to store dangerous JavaScript payloads on the system that will be triggered when the page loads.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2023-34034",
    "repo_url": "https://github.com/spring-projects/spring-security",
    "details": "Using \"**\" as a pattern in Spring Security configuration \nfor WebFlux creates a mismatch in pattern matching between Spring \nSecurity and Spring WebFlux, and the potential for a security bypass.\n\n",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2019-10399",
    "repo_url": "https://github.com/jenkinsci/script-security-plugin",
    "details": "A sandbox bypass vulnerability in Jenkins Script Security Plugin 1.62 and earlier related to the handling of property names in property expressions in increment and decrement expressions allowed attackers to execute arbitrary code in sandboxed scripts.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-46089",
    "repo_url": "https://github.com/jeecgboot/jeecg-boot",
    "details": "In JeecgBoot 3.0, there is a SQL injection vulnerability that can operate the database with root privileges.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2022-3031",
    "repo_url": "https://gitlab.com/gitlab-org/gitlab",
    "details": "An issue has been discovered in GitLab CE/EE affecting all versions before 15.1.6, all versions starting from 15.2 before 15.2.4, all versions starting from 15.3 before 15.3.2. It may be possible for an attacker to guess a user's password by brute force by sending crafted requests to a specific endpoint, even if the victim user has 2FA enabled on their account.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2023-45996",
    "repo_url": "https://github.com/slims/slims9_bulian",
    "details": "SQL injection vulnerability in Senayan Library Management Systems Slims v.9 and Bulian v.9.6.1 allows a remote attacker to obtain sensitive information and execute arbitrary code via a crafted script to the reborrowLimit parameter in the member_type.php.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2016-0595",
    "repo_url": "https://github.com/mysql/mysql-server",
    "details": "Unspecified vulnerability in Oracle MySQL 5.6.27 and earlier allows remote authenticated users to affect availability via vectors related to DML.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-36218",
    "repo_url": "https://github.com/skalenetwork/sgxwallet",
    "details": "An issue was discovered in SKALE sgxwallet 1.58.3. sgx_disp_ippsAES_GCMEncrypt allows an out-of-bounds write, resulting in a segfault and compromised enclave. This issue describes a buffer overflow, which was resolved prior to v1.77.0 and not reproducible in latest sgxwallet v1.77.0",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2016-1202",
    "repo_url": "https://github.com/electron/electron",
    "details": "Untrusted search path vulnerability in Atom Electron before 0.33.5 allows local users to gain privileges via a Trojan horse Node.js module in a parent directory of a directory named on a require line.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2016-10727",
    "repo_url": "https://github.com/gnome/evolution",
    "details": "camel/providers/imapx/camel-imapx-server.c in the IMAPx component in GNOME evolution-data-server before 3.21.2 proceeds with cleartext data containing a password if the client wishes to use STARTTLS but the server will not use STARTTLS, which makes it easier for remote attackers to obtain sensitive information by sniffing the network. The server code was intended to report an error and not proceed, but the code was written incorrectly.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2023-3233",
    "repo_url": "https://github.com/crmeb/crmeb",
    "details": "A vulnerability was found in Zhong Bang CRMEB up to 4.6.0. It has been classified as critical. Affected is the function get_image_base64 of the file api/controller/v1/PublicController.php. The manipulation leads to server-side request forgery. It is possible to launch the attack remotely. The exploit has been disclosed to the public and may be used. The identifier of this vulnerability is VDB-231504. NOTE: The vendor was contacted early about this disclosure but did not respond in any way.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-39260",
    "repo_url": "https://github.com/tuxera/ntfs-3g",
    "details": "A crafted NTFS image can cause an out-of-bounds access in ntfs_inode_sync_standard_information in NTFS-3G < 2021.8.22.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2019-14947",
    "repo_url": "https://github.com/ultimatemember/ultimatemember",
    "details": "The ultimate-member plugin before 2.0.52 for WordPress has XSS during an account upgrade.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-32561",
    "repo_url": "https://github.com/foosel/octoprint",
    "details": "OctoPrint before 1.6.0 allows XSS because API error messages include the values of input parameters.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2020-27821",
    "repo_url": "https://github.com/qemu/qemu",
    "details": "A flaw was found in the memory management API of QEMU during the initialization of a memory region cache. This issue could lead to an out-of-bounds write access to the MSI-X table while performing MMIO operations. A guest user may abuse this flaw to crash the QEMU process on the host, resulting in a denial of service. This flaw affects QEMU versions prior to 5.2.0.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-25917",
    "repo_url": "https://github.com/openemr/openemr",
    "details": "In OpenEMR, versions 5.0.2 to 6.0.0 are vulnerable to Stored Cross-Site-Scripting (XSS) due to user input not being validated properly and rendered in the U2F USB Device authentication method page. A highly privileged attacker could inject arbitrary code into input fields when creating a new user.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-27578",
    "repo_url": "https://github.com/apache/zeppelin",
    "details": "Cross Site Scripting vulnerability in markdown interpreter of Apache Zeppelin allows an attacker to inject malicious scripts. This issue affects Apache Zeppelin Apache Zeppelin versions prior to 0.9.0.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-32752",
    "repo_url": "https://github.com/ethercreative/logs",
    "details": "Ether Logs is a package that allows one to check one's logs in the Craft 3 utilities section. A vulnerability was found in versions prior to 3.0.4 that allowed authenticated admin users to access any file on the server. The vulnerability has been fixed in version 3.0.4. As a workaround, one may disable the plugin if untrustworthy sources have admin access.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2016-6172",
    "repo_url": "https://github.com/powerdns/pdns",
    "details": "PowerDNS (aka pdns) Authoritative Server before 4.0.1 allows remote primary DNS servers to cause a denial of service (memory exhaustion and secondary DNS server crash) via a large (1) AXFR or (2) IXFR response.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2022-26110",
    "repo_url": "https://github.com/htcondor/htcondor",
    "details": "An issue was discovered in HTCondor 8.8.x before 8.8.16, 9.0.x before 9.0.10, and 9.1.x before 9.6.0. When a user authenticates to an HTCondor daemon via the CLAIMTOBE method, the user can then impersonate any entity when issuing additional commands to that daemon.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2023-5900",
    "repo_url": "https://github.com/pkp/pkp-lib",
    "details": "Cross-Site Request Forgery in GitHub repository pkp/pkp-lib prior to 3.3.0-16.\n\n",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-41221",
    "repo_url": "https://github.com/tensorflow/tensorflow",
    "details": "TensorFlow is an open source platform for machine learning. In affected versions the shape inference code for the `Cudnn*` operations in TensorFlow can be tricked into accessing invalid memory, via a heap buffer overflow. This occurs because the ranks of the `input`, `input_h` and `input_c` parameters are not validated, but code assumes they have certain values. The fix will be included in TensorFlow 2.7.0. We will also cherrypick this commit on TensorFlow 2.6.1, TensorFlow 2.5.2, and TensorFlow 2.4.4, as these are also affected and still in supported range.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2022-46051",
    "repo_url": "https://github.com/megatkc/aerocms",
    "details": "The approve parameter from the AeroCMS-v0.0.1 CMS system is vulnerable to SQL injection attacks.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2016-10245",
    "repo_url": "https://github.com/doxygen/doxygen",
    "details": "Insufficient sanitization of the query parameter in templates/html/search_opensearch.php could lead to reflected cross-site scripting or iframe injection.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-2215",
    "repo_url": "https://github.com/mysql/mysql-server",
    "details": "Vulnerability in the MySQL Server product of Oracle MySQL (component: Server: Stored Procedure). Supported versions that are affected are 8.0.23 and prior. Easily exploitable vulnerability allows high privileged attacker with network access via multiple protocols to compromise MySQL Server. Successful attacks of this vulnerability can result in unauthorized ability to cause a hang or frequently repeatable crash (complete DOS) of MySQL Server. CVSS 3.1 Base Score 4.9 (Availability impacts). CVSS Vector: (CVSS:3.1/AV:N/AC:L/PR:H/UI:N/S:U/C:N/I:N/A:H).",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2020-15513",
    "repo_url": "https://github.com/agenturpottkinder/typo3_forum",
    "details": "The typo3_forum extension before 1.2.1 for TYPO3 has Incorrect Access Control.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2016-6504",
    "repo_url": "https://github.com/wireshark/wireshark",
    "details": "epan/dissectors/packet-ncp2222.inc in the NDS dissector in Wireshark 1.12.x before 1.12.13 does not properly maintain a ptvc data structure, which allows remote attackers to cause a denial of service (NULL pointer dereference and application crash) via a crafted packet.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2016-8863",
    "repo_url": "https://github.com/pupnp/pupnp",
    "details": "Heap-based buffer overflow in the create_url_list function in gena/gena_device.c in Portable UPnP SDK (aka libupnp) before 1.6.21 allows remote attackers to cause a denial of service (crash) or possibly execute arbitrary code via a valid URI followed by an invalid one in the CALLBACK header of an SUBSCRIBE request.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2017-15198",
    "repo_url": "https://github.com/kanboard/kanboard",
    "details": "In Kanboard before 1.0.47, by altering form data, an authenticated user can edit a category of a private project of another user.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2017-15203",
    "repo_url": "https://github.com/kanboard/kanboard",
    "details": "In Kanboard before 1.0.47, by altering form data, an authenticated user can remove categories from a private project of another user.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2023-24603",
    "repo_url": "https://github.com/open-xchange/appsuite-frontend",
    "details": "OX App Suite before backend 7.10.6-rev37 does not check size limits when downloading, e.g., potentially allowing a crafted iCal feed to provide an unlimited amount of data.",
    "cwes": [],
    "rating": -1
  },
  {
    "id": "CVE-2021-39882",
    "repo_url": "https://gitlab.com/gitlab-org/gitlab",
    "details": "In all versions of GitLab CE/EE, provided a user ID, anonymous users can use a few endpoints to retrieve information about any GitLab user.",
    "cwes": [],
    "rating": -1
  }
]
